RU09342/lab-4-timers-and-pwm-Veronicaw1013/Software PWM/MSP430FR5529/SoftwarePWM/main.c
#include <msp430.h>

int main(void){

    WDTCTL = WDTPW | WDTHOLD;   // stop watchdog timer
    P4SEL &= ~(BIT7);       // sets port mux
    P1SEL &= ~(BIT0);       // sets port mux
    P4DIR |= BIT7;    // set pin 4.7 as an output
    P1DIR |= BIT0;    // set pin 1.0 as an output
    P2OUT &= ~BIT0;

    P2DIR &= ~BIT1;   // set pin 1.1 as an input
    P2REN |= BIT1;    // Enables pull up or pull down resistor on pin 1.1
    P2OUT |= BIT1;    // Selects pullup resistor

    P2IE |= BIT1;   // interrupt enable on pin 1.1
    P2IES |= BIT1;  //set interrupt to falling edge
    P2IFG &= ~BIT1; // clear interrupt flag
    TB0CTL= MC_1  + TBSSEL_2 + ID_1; //up timer, SMCLK, div 2
    TB0CCTL1 = (CCIE);  // capture/compare interrupt enable
    TB0CCTL0 = (CCIE);
    TB0CCR0= 500-1;        // max value timer will count up to
    TB0CCR1= 250;          // 50% duty cycle at start
    _BIS_SR(LPM0_bits + GIE);        // Enter LPM0 with global interrupt enable
}

#pragma vector=TIMER0_B1_VECTOR
__interrupt void Timer0_B1_ISR (void){
    if(TB0CCR1==500){	// if CCR1 reaches max value
    }
    else{
        P1OUT &= ~BIT0; // LED off
    }
    TB0CCTL1&=~BIT0;    // clear flag
    }
#pragma vector=TIMER0_B0_VECTOR
__interrupt void Timer0_B0_ISR (void){
    if(TB0CCR1 != 0){
    P1OUT |= BIT0;       // LED on
    }
    TB0CCTL0 &=~BIT0;    //clears flags
}
#pragma vector=PORT2_VECTOR      // if the button is pressed...
__interrupt void Port_2(void){
    P2IE &= ~BIT1;              //disable interrupt
    _delay_cycles(50000);       // wait...
    P2IE |= BIT1;               //re-enable interrupt
    P2IES ^= BIT1;              // flip interrupt edge
    if (~P2IES & BIT1){           //if interrupt entered on posedge
        P4OUT ^= BIT7;              // flip other led
        TB0CCR1 += 50;              // increase duty by 10%
        if(TB0CCR1 == 550)
            TB0CCR1 = 0;            
    }
    else if (P2IES & BIT1){      // executes on the negedge
        P4OUT &= ~BIT7;
    }
    P2IFG &= ~BIT1; //clear interrupt flag
}
